{
  "nodes": [
    {
      "op": "null", 
      "param": {}, 
      "name": "data", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Reshape", 
      "param": {
        "keep_highest": "False", 
        "shape": "()", 
        "target_shape": "(0,11,3,40)"
      }, 
      "name": "reshape1", 
      "inputs": [[0, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "NHCW2Conv", 
      "param": {
        "auto_channel_switch": "True", 
        "dim1": "1", 
        "dim2": "2"
      }, 
      "name": "nhcw2conv1", 
      "inputs": [[1, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution1_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution1_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(11,9)", 
        "no_bias": "False", 
        "num_filter": "128", 
        "num_group": "1", 
        "online_quanti": "False", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "transpose_weight": "True", 
        "workspace": "1024"
      }, 
      "name": "convolution1", 
      "inputs": [[2, 0], [3, 0], [4, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Pooling", 
      "param": {
        "global_pool": "False", 
        "kernel": "(1,4)", 
        "legacy_shape": "False", 
        "pad": "(1,1)", 
        "pool_type": "max", 
        "stride": "(1,1)"
      }, 
      "name": "pooling1", 
      "inputs": [[5, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "fullyconnected2_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "fullyconnected2_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "1024"
      }, 
      "name": "fullyconnected2", 
      "inputs": [[6, 0], [7, 0], [8, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "activation2", 
      "inputs": [[9, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "fullyconnected3_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "fullyconnected3_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "1024"
      }, 
      "name": "fullyconnected3", 
      "inputs": [[10, 0], [11, 0], [12, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "activation3", 
      "inputs": [[13, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "softmax_label", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "SoftmaxOutput", 
      "param": {
        "grad_scale": "1", 
        "ignore_label": "-1", 
        "multi_output": "False", 
        "normalization": "null", 
        "use_ignore": "False"
      }, 
      "name": "softmax", 
      "inputs": [[14, 0], [15, 0]], 
      "backward_source_id": -1
    }
  ], 
  "arg_nodes": [0, 3, 4, 7, 8, 11, 12, 15], 
  "heads": [[16, 0]]
}